Ac6Embedded/svd-microchip/PIC32CX_BZ3/WBZ351_SL3.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DGI_SPI</name>
         <version>043660.1 Draft</version>
         <description>SPI DMA for DGI Macro</description>
         <baseAddress>0x44003E00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x54</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DGI_SPI</name>
            <description>DGI_SPI interrupt</description>
            <value>39</value>
         </interrupt>
         <registers>
            <register>
               <name>SPICON</name>
               <description>SPI control register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>GO</name>
                     <description>DMA Operation Status bitThis bit is set by the user software to start the DMA operation. It is reset back to zero by the DMA engine whenthe DMA operation is completed or aborted by clearing the ON bit.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>GOSelect</name>
                        <enumeratedValue>
                           <name>GO_NODMA</name>
                           <description>DMA is not in operation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GO_DMA</name>
                           <description>DMA is in operation</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STXISEL</name>
                     <description>SPI Transmit Service Request Interrupt SelectFor enhanced buffer mode, the SPI generates a Transmit Service Request when:</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>STXISELSelect</name>
                        <enumeratedValue>
                           <name>SPIxTXB_SR_EMPTY</name>
                           <description>The SPIxTXB is empty and SPIxSR is empty (i.e. all transmit operations are complete)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPIxTXB_EMPTY</name>
                           <description>The SPIxTXB is empty</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPIxTXB_HALF_EMPTY</name>
                           <description>The SPIxTXB is at least half empty</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPIxTXB_FULL</name>
                           <description>The SPIxTXB is not full</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKP</name>
                     <description>Clock Polarity Select bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CKPSelect</name>
                        <enumeratedValue>
                           <name>IDLE_LOW_ACTIVE_HIGH</name>
                           <description>Idle state for clock is a low level; active state is a high level</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IDLE_HIGH_ACTIVE_LOW</name>
                           <description>Idle state for clock is a high level; active state is a low level</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SSCON</name>
                     <description>SSControl bits</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SSCONSelect</name>
                        <enumeratedValue>
                           <name>SS_NOT_DMA</name>
                           <description>SS is not controlled by the DMA module</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS_TXCNT</name>
                           <description>SS is asserted for the duration of TXCNT</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKE</name>
                     <description>SPI Clock Edge Select bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CKESelect</name>
                        <enumeratedValue>
                           <name>TX_IDLE_TO_ACTIVE</name>
                           <description>Transmit happens on transition from idle clock state to active clock stat e</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TX_ACTIVE_TO_IDLE</name>
                           <description>Transmit happens on transition from active clock state to idle clock state</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Serial Word Length bits</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DISSDO</name>
                     <description>Disable SDO bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DISSDOSelect</name>
                        <enumeratedValue>
                           <name>SDO_MACRO</name>
                           <description>SDO pin is controlled by the macro</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SDO_PORT</name>
                           <description>SDO pin is not used by the macro. Pin controlled by PORT function</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIDL</name>
                     <description>Stop in Idle control bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SIDLSelect</name>
                        <enumeratedValue>
                           <name>SIDL_OPER_IDLE</name>
                           <description>Continue to operate in CPU Idle mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIDL_HALT_IDLE</name>
                           <description>Halt in CPU Idle mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Freeze bit (in Debug Mode)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>FRZSelect</name>
                        <enumeratedValue>
                           <name>CONTINUE_DEBUG</name>
                           <description>Continue macro operation when in Debug mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BREAK_DEBUG</name>
                           <description>Break macro operation when in Debug mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ON</name>
                     <description>DGISPI On bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ONSelect</name>
                        <enumeratedValue>
                           <name>DISABLE_SFR</name>
                           <description>Turn off and reset macro, disable clocks, disable interrupt event generation, allow SFR modifications.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_SFR</name>
                           <description>Enable macro</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENHBUF</name>
                     <description>Enhanced Buffer Enable bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ENHBUFSelect</name>
                        <enumeratedValue>
                           <name>BUF_DISABLED</name>
                           <description>Enhanced Buffer Mode is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BUF_ENABLED</name>
                           <description>Enhanced Buffer Mode is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MCLKEN</name>
                     <description>Master Clock Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MCLKENSelect</name>
                        <enumeratedValue>
                           <name>PBCLK_BRG</name>
                           <description>PBCLK is used by the BRG</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MCLK_BRG</name>
                           <description>MCLK is used by the BRG</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MSSEN</name>
                     <description>Master Mode Slave Select Enable bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MSSENSelect</name>
                        <enumeratedValue>
                           <name>SLAVE_DISABLED</name>
                           <description>Slave select SPI support disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLAVE_ENABLED</name>
                           <description>SPI Slave Select support enabled </description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPISTAT</name>
               <description>SPI Status register</description>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000008</resetValue>
               <fields>
                  <field>
                     <name>SPITBF</name>
                     <description>SPI Transmit Buffer Full Status bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SPITBFSelect</name>
                        <enumeratedValue>
                           <name>TXB_NOT_FULL</name>
                           <description>SPIxTXB not full</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXB_FULL</name>
                           <description>SPIxTXB is full</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPITBE</name>
                     <description>SPI Transmit Buffer Empty status bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SPITBESelect</name>
                        <enumeratedValue>
                           <name>TXB_NOT_EMPTY</name>
                           <description>SPIxTXB is not empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXB_EMPTY</name>
                           <description>SPIxTXB is empty</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRMT</name>
                     <description>Shift Register (SPIxSR) Empty bit0= There are current or pending transactions</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SRMTSelect</name>
                        <enumeratedValue>
                           <name>SRMT_NO_TRANS</name>
                           <description>There are no current or pending transactions</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPIBUSY</name>
                     <description>SPI activity status bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SPIBUSYSelect</name>
                        <enumeratedValue>
                           <name>SPI_FREE</name>
                           <description>No on-going transactions (at time of read)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI_BUSY</name>
                           <description>Macro currently busy with some transactions</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXBUFELM</name>
                     <description>TransmitBuffer Element Count bits (valid only when ENHBUF = 1)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPIBUF</name>
               <description>SPI BUFFER register</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>FIFO Data bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPIBRG</name>
               <description>SPI Baud rate register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>BRG</name>
                     <description>Baud Rate Divisor bitsseeSection 2.4.1.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPITXADD</name>
               <description>SPI DMA Transmit Address register</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>TXADD</name>
                     <description>Transmit Source Address bitsTXADD can constantly be updated to reflect the current transmit address as the transfer progresses</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPITXCNT</name>
               <description>SPI DMA Transmit Count register</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>TXCNT</name>
                     <description>Transmit Count bitsThis register indicates the number of transferred data words. As the DMA progresses, TXCNT is constantly decremented to reflect the remaining count yet to be transferred.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
